ledgers-middleware/ledgers-middleware-service-impl/src/test/resources/de/adorsys/ledgers/middleware/converter/PaymentSingleTO.yml

paymentId: myPaymentId
endToEndIdentification: 123456789
debtorAccount:
  {
    iban: DE91100000000123456789,
    bban: bban,
    pan: pan,
    maskedPan: maskedPan,
    msisdn: msisdn,
    currency: EUR
  }
instructedAmount:
  {
    currency: EUR,
    amount: 100
  }
creditorAccount:
  {
    iban: DE91100000000123456789,
    bban: bban,
    pan: pan,
    maskedPan: maskedPan,
    msisdn: msisdn,
    currency: EUR
  }
creditorAgent: agent
creditorName: Rozetka.ua
creditorAddress:
    {
      street: SomeStreet,
      buildingNumber: 666,
      city: Kiev,
      postalCode: 04210,
      country: Ukraine
    }
remittanceInformationUnstructured: remittance
paymentStatus: RCVD
paymentProduct: SEPA
requestedExecutionDate: 2018-12-12
requestedExecutionTime: 12:00:00










